Revit 2027 API
FamilyItemFactory.NewSymbolicCurve Method
Create a symbolic curve in an Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SymbolicCurve NewSymbolicCurve(
	Curve curve,
	SketchPlane sketchPlane
)
Public Function NewSymbolicCurve (
	curve As Curve,
	sketchPlane As SketchPlane
) As SymbolicCurve
public:
SymbolicCurve^ NewSymbolicCurve(
	Curve^ curve,
	SketchPlane^ sketchPlane
)
member NewSymbolicCurve :
        curve : Curve *
        sketchPlane : SketchPlane -> SymbolicCurve
Parameters
curve Curve
The geometry curve of the newly created symbolic curve.
sketchPlane SketchPlane
The sketch plane for the symbolic curve.
Return Value
SymbolicCurve
The newly created symbolic curve.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when argument is null.
InvalidOperationException |  Thrown when regeneration failed. Thrown when symbolic curve creation failed.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace